app/views/clientes/index.html.erb

<h1>Listando Clientes</h1>
<% @a = Cliente.first %>
---
SELECT  "clientes".* FROM "clientes"  ORDER BY "clientes"."id" ASC LIMIT 1