app/views/clientes/show.html.erb

<ul>
  <% @cliente.acessos.each do |acesso| %>
---
SELECT "acessos".* FROM "acessos" WHERE "acessos"."cliente_id" = $1  [["cliente_id", 2]]