app/views/acessos/_form.html.erb

SELECT "clientes".* FROM "clientes"
---
    <%= f.label :cliente_id %><br>
    <%= f.collection_select(:cliente_id, Cliente.all, :id, :nome, prompt: true) %>