app/views/acessos/show.html.erb

SELECT "contatos".* FROM "contatos" WHERE "contatos"."acesso_id" = $1  [["acesso_id", 91]]
---
<ul>
  <% @contato.contatos.each do |contato| %>