app/views/contatos/_form.html.erb

    <div class="col-lg-10">
      <%= f.collection_select(:acesso_id, Acesso.all, :id, :id_acesso, {prompt: true}, {:class => 'combobox input-large form-control'}) %>
---
SELECT "acessos".* FROM "acessos"