app/controllers/acessos_controller.rb

  def index
    @acessos = Acesso.all
---
SELECT "acessos".* FROM "acessos"

  def getdatasites

   hostname = params[:hostname]

   cliente = Cliente.select("id").where(site: hostname).first

   t = Acesso.create(id_acesso: params[:id_acesso], url: params[:url], cliente_id: cliente.id )
---
SELECT "clientes"."id" FROM "clientes" WHERE "clientes"."site" = $1  [["site", "gbbs"]]
INSERT INTO "acessos" ("id_acesso", "cliente_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["id_acesso", "aaa"], ["cliente_id", 1], ["created_at", "2016-02-20 01:15:56.661158"], ["updated_at", "2016-02-20 01:15:56.661158"]]

  def create
    @acesso = Acesso.new(acesso_params)

    respond_to do |format|
      if @acesso.save
---
INSERT INTO "acessos" ("id_acesso", "url", "cliente_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id_acesso", "sdfsdf"], ["url", "sdfsd"], ["cliente_id", 2], ["created_at", "2016-02-19 12:56:12.298242"], ["updated_at", "2016-02-19 12:56:12.298242"]]

  def update
    respond_to do |format|
      if @acesso.update(acesso_params)
---
UPDATE "acessos" SET "cliente_id" = $1, "updated_at" = $2 WHERE "acessos"."id" = $3  [["cliente_id", 1], ["updated_at", "2016-02-19 12:56:35.102270"], ["id", 5]]

  def destroy
    @acesso.destroy
---
DELETE FROM "acessos" WHERE "acessos"."id" = $1  [["id", 8]]

    def set_acesso
      @acesso = Acesso.find(params[:id])
---
SELECT  "acessos".* FROM "acessos" WHERE "acessos"."id" = $1 LIMIT 1  [["id", 8]]