app/controllers/clientes_controller.rb

  def index
    @clientes = Cliente.all
---
SELECT  "clientes".* FROM "clientes"  ORDER BY "clientes"."id" ASC LIMIT 1

  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save
---
INSERT INTO "clientes" ("nome", "categoria", "site", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nome", "ertet"], ["categoria", "erte"], ["site", "erterte"], ["created_at", "2016-02-19 11:28:24.841304"], ["updated_at", "2016-02-19 11:28:24.841304"]]

  def update
    respond_to do |format|
      if @cliente.update(cliente_params)
---
UPDATE "clientes" SET "site" = $1, "updated_at" = $2 WHERE "clientes"."id" = $3  [["site", "www.erterte"], ["updated_at", "2016-02-19 11:30:21.215884"], ["id", 5]]

    def set_cliente
      @cliente = Cliente.find(params[:id])
---
SELECT  "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT 1  [["id", 1]]