app/controllers/contatos_controller.rb

  def index
    @contatos = Contato.all
---
SELECT "contatos".* FROM "contatos"

  def create
    @contato = Contato.new(contato_params)

    respond_to do |format|
      if @contato.save
---
INSERT INTO "contatos" ("nome", "email", "mesage", "acesso_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome", "aaa"], ["email", "bbb"], ["mesage", "ccc"], ["acesso_id", 0], ["created_at", "2016-02-19 23:24:26.779120"], ["updated_at", "2016-02-19 23:24:26.779120"]]

    def set_contato
      @contato = Contato.find(params[:id])
---
SELECT  "contatos".* FROM "contatos" WHERE "contatos"."id" = $1 LIMIT 1  [["id", 14]]