app/controllers/welcome_controller.rb

INSERT INTO "acessos" ("id_acesso", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["id_acesso", "teste"], ["url", "testes"], ["created_at", "2016-02-19 18:14:08.307399"], ["updated_at", "2016-02-19 18:14:08.307399"]]
---
  def create

  	#params.require(:cliente).permit(:nome, :categoria)

  	# a = Cliente.new(params)
  	# a.nome = pa.nome
  	# a.categoria = params.categoria
  	# @cliente.save

  	t = Acesso.create(id_acesso: params[:nome], url: params[:categoria])