app/controllers/welcome_controller.rb

INSERT INTO "clientes" ("nome", "categoria", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nome", "mario"], ["categoria", "menino"], ["created_at", "2016-02-18 19:44:03.723804"], ["updated_at", "2016-02-18 19:44:03.723804"]]
---
  def create

  	t = Cliente.create(nome: "mario", categoria: "menino")